
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
    // СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
    // СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
    ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТовары

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПриИзменении(Элемент)
	РассчитатьСуммуДокумента();
КонецПроцедуры

//&НаКлиенте
//Процедура ТоварыСкидкаПриИзменении(Элемент)
//	++ Симбирёва 02.12.2025
//	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
//	
//	РассчитатьСуммуСтроки(ТекущиеДанные);
//	-- Симбирёва 02.12.2025
//КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыУслуги

&НаКлиенте
Процедура УслугиКоличествоПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Услуги.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиЦенаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Услуги.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

//&НаКлиенте
//Процедура УслугиСкидкаПриИзменении(Элемент)
//	++ Симбирёва 02.12.2025
//	ТекущиеДанные = Элементы.Услуги.ТекущиеДанные;
//	
//	РассчитатьСуммуСтроки(ТекущиеДанные);
//	-- Симбирёва 02.12.2025
//КонецПроцедуры

&НаКлиенте
Процедура УслугиПриИзменении(Элемент)
	РассчитатьСуммуДокумента();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура РассчитатьСуммуСтроки(ТекущиеДанные)

// ++ Симбирёва 02.12.2025
КоэффициентСкидки = 1 - Объект.ДК_СогласованнаяСкидка / 100;
ТекущиеДанные.Сумма = ТекущиеДанные.Цена * ТекущиеДанные.Количество * КоэффициентСкидки;
// -- Симбирёва 02.12.2025
	
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьСуммуДокумента()
	
	Объект.СуммаДокумента = Объект.Товары.Итог("Сумма") + Объект.Услуги.Итог("Сумма");
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаОбновить(Команда); 

// ++ Симбирёва 02.12.2025
	ПересчитатьВсеСтроки();
	РассчитатьСуммуДокумента();
// -- Симбирёва 02.12.2025
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьВсеСтроки()
	
	// ++ Симбирёва 02.12.2025
	Для Каждого Строка Из Объект.Товары Цикл 	
		РассчитатьСуммуСтроки(Строка);	
	КонецЦикла;
	
	Для Каждого Строка Из Объект.Услуги Цикл 
		РассчитатьСуммуСтроки(Строка);
	КонецЦикла;
    // -- Симбирёва 02.12.2025
	
КонецПроцедуры

&НаКлиенте
Асинх Процедура ЗадатьВопросПользователю(); 
	
	// ++ Симбирёва 02.12.2025
	Если Объект.Товары.Количество() = 0 И Объект.Услуги.Количество() = 0 Тогда 
		
		Возврат;
		
	Иначе
		
		Результат = Ждать ВопросАсинх(НСтр("ru='Пересчитать сумму по всем позициям?'"), РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Да);
	
		Если Результат = КодВозвратаДиалога.Нет Тогда  	
		
        	Возврат;   
		
		ИначеЕсли Результат = КодВозвратаДиалога.Да Тогда  
			
			ПересчитатьВсеСтроки();
			РассчитатьСуммуДокумента();

		КонецЕсли;
		
	КонецЕсли;
	// -- Симбирёва 02.12.2025

КонецПроцедуры

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
    ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
    ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
    ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

